** create the rds
#+BEGIN_SRC bash
egrep '^RDS_HOSTNAME=' envs/aws || (./lambda/rds-create.sh | egrep '^RDS_HOSTNAME=' | tee -a envs/aws
echo 'DBURIADMIN="postgres://postgres:$RDS_PASSWORD@$RDS_HOSTNAME/template1"' | tee -a envs/aws
echo 'DBURI="postgres://postgres:$RDS_PASSWORD@$RDS_HOSTNAME/"' | tee -a envs/aws
)
./setenv.sh aws
#+END_SRC

#+RESULTS:
| RDS_HOSTNAME=svelte-postgrest-template-test5.czemoyaft9tl.us-east-1.rds.amazonaws.com |            |         |      |            |        |    |    |     |      |
| postgres://postgres:$RDS_PASSWORD@$RDS_HOSTNAME/template1                             |            |         |      |            |        |    |    |     |      |
| postgres://postgres:$RDS_PASSWORD@$RDS_HOSTNAME/                                      |            |         |      |            |        |    |    |     |      |
| *                                                                                     | removing   | old     | env  | (disregard | error  | if | no | env | set) |
| *                                                                                     | symlinking | .env.sh |      |            |        |    |    |     |      |
| *                                                                                     | evaluating | .env.sh | into | .env       | (node) |    |    |     |      |

